{
  "_class_name": "LTX2VideoTransformer3DModel",
  "_diffusers_version": "0.37.1",
  "in_channels": 128,
  "out_channels": 128,
  "patch_size": 1,
  "patch_size_t": 1,
  "num_attention_heads": 32,
  "attention_head_dim": 128,
  "cross_attention_dim": 4096,
  "vae_scale_factors": [
    8,
    32,
    32
  ],
  "pos_embed_max_pos": 20,
  "base_height": 2048,
  "base_width": 2048,
  "audio_in_channels": 128,
  "audio_out_channels": 128,
  "audio_patch_size": 1,
  "audio_patch_size_t": 1,
  "audio_num_attention_heads": 32,
  "audio_attention_head_dim": 64,
  "audio_cross_attention_dim": 2048,
  "audio_scale_factor": 4,
  "audio_pos_embed_max_pos": 20,
  "audio_sampling_rate": 16000,
  "audio_hop_length": 160,
  "num_layers": 48,
  "activation_fn": "gelu-approximate",
  "qk_norm": "rms_norm_across_heads",
  "norm_elementwise_affine": false,
  "norm_eps": 1e-06,
  "caption_channels": 3840,
  "attention_bias": true,
  "attention_out_bias": true,
  "rope_theta": 10000.0,
  "rope_double_precision": true,
  "causal_offset": 1,
  "timestep_scale_multiplier": 1000,
  "cross_attn_timestep_scale_multiplier": 1000,
  "rope_type": "interleaved"
}