{
  "_class_name": "Flux2Transformer2DModel",
  "_diffusers_version": "0.37.1",
  "patch_size": 1,
  "in_channels": 128,
  "out_channels": null,
  "num_layers": 8,
  "num_single_layers": 48,
  "attention_head_dim": 128,
  "num_attention_heads": 48,
  "joint_attention_dim": 15360,
  "timestep_guidance_channels": 256,
  "mlp_ratio": 3.0,
  "axes_dims_rope": [32, 32, 32, 32],
  "rope_theta": 2000,
  "eps": 1e-06,
  "guidance_embeds": true
}
