{
  "_class_name": "WanTransformer3DModel",
  "_diffusers_version": "0.37.1",
  "attention_head_dim": 128,
  "cross_attn_norm": true,
  "eps": 1e-06,
  "ffn_dim": 13824,
  "freq_dim": 256,
  "in_channels": 52,
  "num_attention_heads": 40,
  "num_layers": 40,
  "out_channels": 16,
  "patch_size": [1, 2, 2],
  "qk_norm": "rms_norm_across_heads",
  "text_dim": 4096
}
