{
  "_class_name": "CosmosTransformer3DModel",
  "_diffusers_version": "0.37.1",
  "adaln_lora_dim": 256,
  "attention_head_dim": 128,
  "concat_padding_mask": true,
  "controlnet_block_every_n": null,
  "crossattn_proj_in_channels": 1024,
  "encoder_hidden_states_channels": 1024,
  "extra_pos_embed_type": "learnable",
  "img_context_dim_in": null,
  "img_context_dim_out": 2048,
  "img_context_num_tokens": 256,
  "in_channels": 16,
  "max_size": [128, 240, 240],
  "mlp_ratio": 4.0,
  "num_attention_heads": 16,
  "num_layers": 28,
  "out_channels": 16,
  "patch_size": [1, 2, 2],
  "rope_scale": [2.0, 1.0, 1.0],
  "text_embed_dim": 1024,
  "use_crossattn_projection": false
}
